DataProcessors/ПриемкаКоллективная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПриемкаКоллективная</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЯчейкаПриемки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаПриемкиГУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСкладскогоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументГУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоставкаОтВнешнегоПоставщика</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьСостояниеКодаВЧЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьСоответствиеКодаТоваруПоGTIN</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьПриниматьКМБезПроверкиСостояния</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СверятьКодыСОжидаемымиПриПриемке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширеннаяПроверкаВалидностиКодовМаркировкиЧЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/СписокТоваровДокументаПТУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СписокТоваровДокументаПТУ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НаименованиеТовара</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПроизводителяТовара</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормализованныйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодЕдиИзм</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдИзмНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоТовара</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоТовараНабрано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоВРазмещении</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоОформление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаАВСФилиала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТоварТребуетсяМаркировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоОжидаемыхМаркировок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоВБуфереМаркировок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоОтсканированныхМаркировок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоТоваровСМаркировкой</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоРазместитьДляВозврата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПревышенаДатаМаркировкиОстатков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТоварнаяГруппа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СсылкаПТУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СсылкаТовара</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ПриемкаКоллективная/Forms/ФормаСканированияМаркировок/Ext/Form/Module.bsl
&НаКлиенте
Перем Компонента;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначения.УстановитьРежимВыбораДляДокументаРазмещения("ВыборНомеклатурыДляМаркировки");
	ОбщегоНазначения.УстановитьРежимВводаНаСервере(Истина);     
	
	//+Шульман А. 13.11.2025 #UT10-5504
	Объект.ПроверятьСостояниеКодаВЧЗ = Константы.ПроверятьСостояниеКодаВЧЗ.Получить();
	Объект.РазрешитьПриниматьКМБезПроверкиСостояния = Константы.РазрешитьПриниматьКМБезПроверкиСостояния.Получить();
	//-Шульман А. 13.11.2025 #UT10-5504
	
	//+Шульман А. 20.11.2025 #UT10-5518
	Объект.ПроверятьСоответствиеКодаТоваруПоGTIN = Константы.ПроверятьСоответствиеКодаТоваруПоGTIN.Получить();  
	Объект.РасширеннаяПроверкаВалидностиКодовМаркировкиЧЗ = Константы.РасширеннаяПроверкаВалидностиКодовМаркировкиЧЗ.Получить();
	//-Шульман А. 20.11.2025 #UT10-5518 
	
	//+Шульман А. 28.11.2025 #UT10-5550   
	Объект.СверятьКодыСОжидаемымиПриПриемке = Константы.СверятьКодыСОжидаемымиПриПриемке.Получить();   
	//-Шульман А. 28.11.2025 #UT10-5550     
	
	//+Шульман А. 05.12.2025 #UT10-5576
	ЗаписыватьРасширенныеЛоги = Константы.ЗаписыватьРасширенныеЛоги.Получить();
	//-Шульман А. 05.12.2025 #UT10-5576
	
КонецПроцедуры   


&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ПараметрыРаботы = ОбщегоНазначения.ПолучитьПараметрыРаботыСДокументомПТУ();	
	ЗаполнитьЗначенияСвойств(Объект, ПараметрыРаботы);

	Компонента = ОбщегоНазначенияКлиент.ПодключитьКомпоненту();	
	
	Если Компонента <> Неопределено И Не Компонента.Подключить() Тогда		
		ТекстОшибки = "";
		КодОшибки = Компонента.ПолучитьОшибку(ТекстОшибки);                                                   
		ПоказатьПредупреждение(,"Ошибка: "+КодОшибки+", " + ТекстОшибки);
	КонецЕсли;	
	
	РезультатСтруктура = ОбщегоНазначения.ПолучитьОстатокПоВсемТоварамИзДокумента(Объект.ДокументГУИД);

	ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();
	ОбщегоНазначения.ПолучитьСписокМаркировокПоПТУ(Объект.ДокументГУИД);  
	Элементы.СписокМаркировокВБуфере.Обновить();
	
	Оповестить("ОбновитьГруппуОсталостьИНабрано");

КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьСканирование(Команда)
	
	ЭтаФорма.ОписаниеОшибки = "";
	ЭтаФорма.ОписаниеНайденногоТовара =  "";
	ЭтаФорма.Штрихкод = "";
	ЭтаФорма.ЗначениеДляПоиска = "";
	
	
	ОбщегоНазначенияКлиент.ОчиститьПоляНайденныйТовар(ЭтаФорма);	
	ОбщегоНазначения.УстановитьРежимВыбораДляДокументаРазмещения("ВыборНомеклатурыДляМаркировки");		
	ОбщегоНазначения.УстановитьРежимВводаНаСервере(Истина);
	
	ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();		
	
	Оповестить("ГруппаПоискаТовара", Истина);
	Оповестить("СканированиеШтрихкода");	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСлуженоеСообщениеПодвал() Экспорт
	
	ЭтаФорма.Подвал.Очистить();	
	СтрокаТЗ = Подвал.Добавить();

	СтрокаТЗ.ФИОСотрудинка = ОбщегоНазначенияКлиент.ПолучитьОписаниеСотрудника();
	СтрокаТЗ.ОписаниеРежимаВводаКоличества = ОбщегоНазначенияКлиент.ПолучитьОтображениеОРежимеВводеКоличества();
	Элементы.Подвал.Обновить();
	
	ЭтаФорма.ПодвалСообщение.Очистить();	
	СтрокаТЗ = ПодвалСообщение.Добавить();	
	СтрокаТЗ.СообщениеДляПользователя = ОбщегоНазначения.ПолучитьИнструкциюДействийДляПользователя(ЭтаФорма.ОписаниеОшибки ,"Обработка.ПриемкаКоллективная.Форма.ФормаСканированияМаркировок");
	Элементы.ПодвалСообщение.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров() Экспорт
	
	ОбновитьСлуженоеСообщениеПодвал();
	Элементы.Набрано.Обновить();
	
	Если ЗначениеЗаполнено(ЭтаФорма.ОписаниеОшибки) Тогда
		
		Элементы.ГруппаСтраницыРаботаСТоваров.ТекущаяСтраница = Элементы.ГруппаСтраница_ОшибкаСканирования;
		Элементы.ГруппаСтраница_ОтсутствиеШК_вПоставке.Видимость = Ложь;
		Элементы.ГруппаСтраница_АвтоматическийВвод.Видимость = Ложь;
		Элементы.ГруппаСтраница_ОшибкаСканирования.Видимость = Истина;
		
		Возврат;
		
	КонецЕсли; 
		
	РежимВводаАвтоматический = ОбщегоНазначения.УстановленРежимВводаАвтоматический();	
	
	Если РежимВводаАвтоматический И ОбщегоНазначения.ПолучитьСтатусРаботыСРазмещениемДокумента() <> "ШКнеНайденВПоставке" Тогда
		
		Элементы.ГруппаСтраницыРаботаСТоваров.ТекущаяСтраница = Элементы.ГруппаСтраница_АвтоматическийВвод;
		Элементы.ГруппаСтраница_АвтоматическийВвод.Видимость = Истина;
		Элементы.ГруппаСтраница_ОшибкаСканирования.Видимость = Ложь;
				
	ИначеЕсли ОбщегоНазначения.ПолучитьСтатусРаботыСРазмещениемДокумента() = "ШКнеНайденВПоставке" Тогда
		
		Элементы.ГруппаСтраницыРаботаСТоваров.ТекущаяСтраница = Элементы.ГруппаСтраница_ОтсутствиеШК_вПоставке;		
		Элементы.ГруппаСтраница_ОтсутствиеШК_вПоставке.Видимость = Истина;
		Элементы.ГруппаСтраница_АвтоматическийВвод.Видимость = Ложь;
		Элементы.ГруппаСтраница_ОшибкаСканирования.Видимость = Ложь;
		
	КонецЕсли; 
	
КонецПроцедуры                                                                   

&НаКлиенте
Процедура ВключитьПоискТовара(Команда)
		
	ЭтаФорма.ОписаниеОшибки = "";
	ЭтаФорма.ОписаниеНайденногоТовара =  "";
	ЭтаФорма.Штрихкод = "";
	ЭтаФорма.ЗначениеДляПоиска = "";
	
	ОбщегоНазначенияКлиент.ОчиститьПоляНайденныйТовар(ЭтаФорма);		
	ОбщегоНазначения.УстановитьРежимВыбораДляДокументаРазмещения("ВыборНомеклатурыДляМаркировки");		
	ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();	
	Оповестить("ГруппаПоискаТовара", Истина);	
	Оповестить("СканированиеШтрихкода");		
			
КонецПроцедуры

&НаКлиенте
Процедура Поиск(Команда)
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.ЗначениеДляПоиска) Тогда
		Сообщить("Введите код производителя или штрихкод.");
		Возврат;
	КонецЕсли; 
	
	ЭтаФорма.Штрихкод = ЭтаФорма.ЗначениеДляПоиска;
	ЭтаФорма.ТоварГУИД = "";
	СтрокаGS = "";
				
	ОбработкаОтсканированногоТовара();
	ЭтаФорма.ЗначениеДляПоиска = "";

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтсканированногоТовара() Экспорт

	Оповестить("ГруппаПоискаТовара", Ложь);	
	
	РежимВводаАвтоматический = ОбщегоНазначения.УстановленРежимВводаАвтоматический();	
	
	Если РежимВводаАвтоматический Тогда
		
		Результат = ОбработкаШтрихкодаАвтоматический.ОбработкаШтрихкодаВАвтоматическомРежиме(ЭтаФорма, "ПоступлениеТоваровУслуг");
		
		Если ЭтаФорма.ОтсканированТовар Тогда
			ОбщегоНазначения.УстановитьРежимВыбораДляДокументаРазмещения("ВыборМаркировки");
		Иначе
			ОбщегоНазначения.УстановитьРежимВыбораДляДокументаРазмещения("ВыборНомеклатурыДляМаркировки");
		КонецЕсли;
		
		ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();
		Оповестить("ГруппаПоискаТовара", Ложь);
		
		//+Сёмин Р.И. 28.09.2026 #UT10-6057
		Оповестить("ОбновитьГруппуОсталостьИНабрано");
		//-Сёмин Р.И. 28.09.2026 #UT10-6057
		
	КонецЕсли;
	
	Если Результат = "НеизвестныйШтрихкод" Тогда
		
		Структура = Новый Структура;
		Структура.Вставить("Штрихкод", Штрихкод);                            
		Структура.Вставить("ЭтаФорма", ЭтаФорма);					
		
		
		ОбщегоНазначенияКлиент.ИнициализацияТЗ_Набрано(ЭтаФорма);
		ОбщегоНазначения.УстановитьРежимВыбораДляДокументаРазмещения("ШКнеНайденВПоставке");
		ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();		
		
	КонецЕсли;

КонецПроцедуры   
                      
&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	// Пользователь может нажать несколько раз сканирование штрихкода, но форма уже закрыта.
	Если Не ВводДоступен() Тогда   
		Возврат;
	КонецЕсли; 
	
	//+Шульман А. 05.12.2025 #UT10-5576
	Если ИгнорироватьВнешнееСобытие Тогда  
		
		Если ЗаписыватьРасширенныеЛоги Тогда
			ASK_ОбработкаОшибок.ПолучитьСтекВызовов("Форма сканирования. ВнешнееСобытие.", "Возврат", Истина);
		КонецЕсли;       
		
		Возврат;
		
	КонецЕсли;  
	//-Шульман А. 05.12.2025 #UT10-5576
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаОсновная;
	СимволРазделитель = "{GS}";
	
	Если Событие = "UniversalBroadcastEvent" Тогда
		
		
	    //-Шульман А. 05.12.2025 #UT10-5576
		
		Результат = ОбщегоНазначения.ПолучитьЗначениеШтрихкода(Данные, СимволРазделитель);
		
		Если ЗначениеЗаполнено(Результат.Ошибка) Тогда
			
			ПоказатьПредупреждение(, "Ошибка сканирования штрихкода", 4);
			Возврат;
			
		КонецЕсли; 
	
		ЭтаФорма.Штрихкод = Результат.Штрихкод;   
		
		//+Шульман А. 05.12.2025 #UT10-5576   
		СтрокаGS = "";
		
		Если ОбщегоНазначения.ПолучитьКонстанту("РасширеннаяПроверкаВалидностиКодовМаркировкиЧЗ") Тогда
		
			Попытка
				
				СтрокаGS = ОбщегоНазначенияКлиент.ПолучитьПозицииGS(ЭтаФорма.Штрихкод, СимволРазделитель);
				
				Пока НЕ СтрНайти(ЭтаФорма.Штрихкод, СимволРазделитель) = 0 Цикл
					ЭтаФорма.Штрихкод = СтрЗаменить(ЭтаФорма.Штрихкод, СимволРазделитель,"");
				КонецЦикла;
				
			Исключение                                           
				
				ASK_ОбработкаОшибок.ЗаписатьИнформациюВЛогОшибок("Ошибка", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), 
				"Форма сканирования. ВнешнееСобытие", "Поиск GS");   
				Возврат;
				
			КонецПопытки;     
		
		КонецЕсли;
		
		ЭтаФорма.ТоварГУИД = "";                
		
		ОбработкаОтсканированногоТовара();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "СканированиеШтрихкода" Тогда
		
		#Если МобильноеПриложениеКлиент Тогда
			Если ЗначениеЗаполнено(ЭтаФорма.ОписаниеОшибки) Тогда
				Компонента.Отключить();
			Иначе
				Компонента.Подключить();
			КонецЕсли; 
		#КонецЕсли 	
		Возврат;		
	КонецЕсли; 
	
	Если ИмяСобытия = "ОбновитьГруппуОсталостьИНабрано" Тогда	
		
		РезультатСтруктура = ОбщегоНазначения.ЗагрузитьСписокДокументовПТУ(, Объект.ДокументГУИД);	
		Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
			ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
			Возврат;
		КонецЕсли; 
		
		Запись = РезультатСтруктура.Данные[0];
		ЭтаФорма.Шапка.Очистить();
		СтрокаТЗ = Шапка.Добавить();
		СтрокаТЗ.ЗаголовокСкладскогоДокумента = "В работе";
		СтрокаТЗ.НомерСкладскогоДокумента = Объект.НомерСкладскогоДокумента;
		
		//+Сёмин Р.И. 28.09.2026 #UT10-6057
		//ОсталосьМаркировок  = "осталось: " + Строка(Запись.КоличествоТоваровСМаркировкой - Запись.КоличествоОтсканированныхМаркировок);
		ОсталосьМаркировок  = "осталось: " + Строка(Запись.КоличествоТоваровСМаркировкой - (Запись.КоличествоОтсканированныхМаркировок + Запись.КоличествоСтрокВБуфереМаркировок));
		//-Сёмин Р.И. 28.09.2026 #UT10-6057
		
		ВсегоМаркировок     = "из " + Строка(Запись.КоличествоТоваровСМаркировкой)  + " маркировок";
		
		//+Сёмин Р.И. 28.09.2026 #UT10-6057
		//СтрокаТЗ.ОписаниеСтатусаМаркировки = ОсталосьМаркировок + "   " + ВсегоМаркировок;
		СтрокаТЗ.ОписаниеСтатусаМаркировки = ОсталосьМаркировок + " " + ВсегоМаркировок;
		//-Сёмин Р.И. 28.09.2026 #UT10-6057
		
		Возврат;
		
	КонецЕсли;
	
	Если ИмяСобытия = "ГруппаПоискаТовара" Тогда
		
		//Элементы.ГруппаПоискаТовара.Видимость = Параметр;    
		Если ОбщегоНазначения.ПолучитьСтатусРаботыСРазмещениемДокумента() = "ВыборНомеклатурыДляМаркировки" Тогда
			Элементы.ЗначениеДляПоиска.Заголовок = "Товар"; 
		Иначе
			Элементы.ЗначениеДляПоиска.Заголовок = "QR-код";  
		КонецЕсли;
		
		ЭтаФорма.ЗначениеДляПоиска = "";
		Возврат;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	//+Шульман А. 28.11.2025 #UT10-5548  
	ПерейтиВСписокДокументов = Ложь;
	
	Если Не ТипЗнч(РезультатПередЗакрытием) = Тип("Структура") Тогда  
		
		// Перед закрытием задаются вопросы. Результаты записываются в РезультатПередЗакрытием 
		ДействияПередЗакрытием(Отказ);   
		
		Если Отказ Тогда
			
			РезультатПередЗакрытием = Неопределено;  
			Возврат;
			
		КонецЕсли;    
		
	КонецЕсли;
	
	//+Шульман А. 28.11.2025 #UT10-5548 К05122025
	//Если ТипЗнч(РезультатПередЗакрытием) = Тип("Структура") Тогда  
	//	
	//	// По результатам вопросам выполняются действия 
	//	Если РезультатПередЗакрытием.Свойство("СоздатьРазмещениеДляМаркировки") Тогда   
	//		СоздатьДокументРазмещения();    
	//	КонецЕсли;
	//	
	//	Если РезультатПередЗакрытием.Свойство("ЗаписатьМаркировкиВПТУ") Тогда   
	//		ЗаписатьМаркировкиВПТУ();    
	//	КонецЕсли;
	//	
	//КонецЕсли; 
	//-Шульман А. 28.11.2025 #UT10-5548 К05122025
	
	//-Шульман А. 28.11.2025 #UT10-5548
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Компонента <> Неопределено Тогда		
		Компонента.Отключить();	
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияПередЗакрытием(Отказ)
	
	//+Шульман А. 28.11.2025 #UT10-5548
	ЗаписатьВБуферНеотсканированныеМарки();  
	
	Если РезультатПередЗакрытием.Свойство("Отказ") Тогда
		Отказ = Истина;
		
	ИначеЕсли РезультатПередЗакрытием.Свойство("ПроверитьЛичныйШК") Тогда   
		
		//+Шульман А. 05.12.2025 #UT10-5576
		ИгнорироватьВнешнееСобытие = Истина;
		
		Если Компонента <> Неопределено Тогда		
			Компонента.Отключить();	
		КонецЕсли;  
		//-Шульман А. 05.12.2025 #UT10-5576
		
		Отказ = Истина;     
		
		ДополнительныеПараметры  = Новый Структура("Возвращать, Результат", РезультатПередЗакрытием.Возвращать, РезультатПередЗакрытием);    
		
		Оповещение = Новый ОписаниеОповещения("ЗаписатьВБуферНеотсканированныеМаркиЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЗаголовокПоляВвода", "Подтвердите размещение остатка для " + ?(РезультатПередЗакрытием.Возвращать, "возврата", "маркировки"));	
		
		ОткрытьФорму("Обработка.ОбщиеФормы.Форма.ФормаАвторизация", ПараметрыФормы, ЭтаФорма, ,, , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
		
	КонецЕсли;
	//-Шульман А. 28.11.2025 #UT10-5548

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьВБуферНеотсканированныеМарки()
	
	ЕстьНеОтсканированнаяМаркировка = ПолучитьНеотсканированныеМаркировки(); 
	
	РезультатПередЗакрытием = Новый Структура();
	
	Если Не ЕстьНеОтсканированнаяМаркировка Тогда    
		
		//+Шульман А. 28.11.2025 #UT10-5548 К05122025
		//РезультатПередЗакрытием.Вставить("ЗаписатьМаркировкиВПТУ");   
		ПерейтиВСписокДокументов = Истина;
		ЗаписатьМаркировкиВПТУ();
		//-Шульман А. 28.11.2025 #UT10-5548 К05122025
		Возврат;
		
	КонецЕсли;
	
	// Есть неотсканированные марки, нужна маркировка  
	СписокОтветов = Новый СписокЗначений;  
	
	СписокОтветов.Добавить(1, "Создать на оставшиеся позиции маркировку");   
	СписокОтветов.Добавить(2, "Разместить для возврата");         
	СписокОтветов.Добавить(3, "Не создавать");     
	
	ОтветНаВопрос = Вопрос("" , СписокОтветов , , 1 , "Отсканированы не все марки");  
	
	Если ОтветНаВопрос = 1 Тогда  
		
		РезультатПередЗакрытием.Вставить("ПроверитьЛичныйШК");    
		РезультатПередЗакрытием.Вставить("Возвращать", Ложь);  
		
	ИначеЕсли ОтветНаВопрос = 2 Тогда
		
		РезультатПередЗакрытием.Вставить("ПроверитьЛичныйШК");    
		РезультатПередЗакрытием.Вставить("Возвращать", Истина);   
		
	ИначеЕсли ОтветНаВопрос = 3 Тогда  
		
		// Кладовщик отказывается от маркировки, просто нужна запись отсканированных марок в ПТУ
		тзОстатокМаркировка.Очистить();                       
		//+Шульман А. 28.11.2025 #UT10-5548 К05122025
		//РезультатПередЗакрытием.Вставить("ЗаписатьМаркировкиВПТУ"); 
		ЗаписатьМаркировкиВПТУ();
        //-Шульман А. 28.11.2025 #UT10-5548 К05122025
		
	Иначе
		РезультатПередЗакрытием.Вставить("Отказ");
	КонецЕсли;   

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьВБуферНеотсканированныеМаркиЗавершение(РезультатОтвет, ДопПараметры) Экспорт
	
	//+Шульман А. 28.11.2025 #UT10-5548 
	Если РезультатОтвет = "ОК" Тогда
		
		ЗаписатьВБуферНеотсканированныеМаркиФрагмент(ДопПараметры.Возвращать, ДопПараметры.Результат);   
		//+Шульман А. 28.11.2025 #UT10-5548 К05122025
		//Закрыть();
		//-Шульман А. 28.11.2025 #UT10-5548 К05122025
		
	Иначе         
		
		РезультатПередЗакрытием = Новый Структура;   
		тзОстатокМаркировка.Очистить();   
		
		//+Шульман А. 28.11.2025 #UT10-5548 К05122025  
		//РезультатПередЗакрытием.Вставить("ЗаписатьМаркировкиВПТУ");
		//Закрыть();       
		ПерейтиВСписокДокументов = Истина;
		ЗаписатьМаркировкиВПТУ();
		//-Шульман А. 28.11.2025 #UT10-5548 К05122025
		
	КонецЕсли;
	//-Шульман А. 28.11.2025 #UT10-5548

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьВБуферНеотсканированныеМаркиФрагмент(Возвращать, Результат)
	
	//+Шульман А. 28.11.2025 #UT10-5548   
	РезультатПередЗакрытием = Новый Структура;
	
	ОбщаяЯчейкаДляМаркировки = ОбщегоНазначения.ПолучитьКонстанту("ЯчейкаДляМаркировки"); 
	ОбщаяЯчейкаДляПеремаркировки = ОбщегоНазначения.ПолучитьКонстанту("ЯчейкаДляПеремаркировки"); 
	ОбщаяЯчейкаДляВозврата = ОбщегоНазначения.ПолучитьКонстанту("ЯчейкаДляВозврата"); 
	
	Если Возвращать Тогда
		ЯчейкаДляМаркировки = ОбщаяЯчейкаДляВозврата;  
	КонецЕсли;
	
	ГУИДПользователя = ОбщегоНазначения.ПолучитьПользователяГУИД();  
	ТекДата = ТекущаяДата();  
	
	РежимВвода = ОбщегоНазначения.УстановленРежимВводаРучной();
	
	Для каждого тзСтрока Из тзОстатокМаркировка Цикл
		
		мТоварГУИД = тзСтрока.СсылкаТовара;      
		мКоличество = тзСтрока.Количество;   
		мШтрихкод = "";       
		
		Если Не Возвращать Тогда
		
			Если тзСтрока.ПревышенаДатаМаркировкиОстатков Тогда
				ЯчейкаДляМаркировки = ОбщаяЯчейкаДляПеремаркировки;
            Иначе
				ЯчейкаДляМаркировки = ОбщаяЯчейкаДляМаркировки;
			КонецЕсли;
			
		КонецЕсли;   
		
		РезультатСтруктура = ОбщегоНазначения.ДобавитьТоварВБуферАРМКладовщика(Объект.ДокументГУИД, мТоварГУИД, ГУИДПользователя, 
				ТекДата, мШтрихкод, мКоличество, ЯчейкаДляМаркировки, РежимВвода);			
		
		Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда  
					
			ПоказатьПредупреждение(, "Ошибка: " + РезультатСтруктура.Ошибка, 4);    
			
			РезультатПередЗакрытием.Вставить("Отказ");
			Возврат;
			
		ИначеЕсли РезультатСтруктура.Данные = Ложь Тогда 
			
			ПоказатьПредупреждение(, "Ошибка записи в буфер кладовщика для создания кода маркировки");
			РезультатПередЗакрытием.Вставить("Отказ");
			Возврат;
			
		КонецЕсли; 
		
	КонецЦикла;   
	
	//+Шульман А. 28.11.2025 #UT10-5548 К05122025
	//РезультатПередЗакрытием.Вставить("СоздатьРазмещениеДляМаркировки");
	//РезультатПередЗакрытием.Вставить("ЗаписатьМаркировкиВПТУ");  
	ПерейтиВСписокДокументов = Истина;
	СоздатьДокументРазмещения();          
	ЗаписатьМаркировкиВПТУ(", созданы размещения для маркировки");
	//-Шульман А. 28.11.2025 #UT10-5548 К05122025

	//-Шульман А. 28.11.2025 #UT10-5548

КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументРазмещения() Экспорт
	
	//+Шульман А. 02.10.2025 #UT10-5438  
	РезультатСтруктура = ОбщегоНазначения.СоздатьДокуметРазмещенияПоЯчейкам(Объект.ДокументГУИД);
	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		
		Если НЕ РезультатСтруктура.Ошибка = "Отсутствуют отсканированные строки документа" Тогда
			ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 4);	
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли; 
	
	//ТекстСообщения = "Создан документ размещения по ячейкам № %1 %2. Документ проведен";
	//
	//ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, 
	//		РезультатСтруктура.Данные.НомерДокумента,
	//		РезультатСтруктура.Данные.ДатаДокумента 
	//		);						
	//		
	//Оповестить("СообщениеСозданДокументРазмещенияПоЯчейкам", Новый Структура("ТекстСообщения", ТекстСообщения));	
	//-Шульман А. 02.10.2025 #UT10-5438
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьМаркировкиВПТУ(ДобТекст = "") Экспорт 
	
	РезультатСтруктура = ОбщегоНазначения.ЗаписатьМаркировкиВДокументПТУ(Объект.ДокументГУИД);
	
	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		
		Если НЕ РезультатСтруктура.Ошибка = "Отсутствуют отсканированные маркировки" Тогда
			ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 4);	
		КонецЕсли;
		
		//+Шульман А. 28.11.2025 #UT10-5548 К05122025
		Если ПерейтиВСписокДокументов Тогда
			
			Закрыть();
			ОткрытьФорму("Обработка.ПриемкаКоллективная.Форма.ФормаСпискаПТУ");			
			Оповестить("МаркировкиЗаписаныВПТУ", Новый Структура("ТекстСообщения", 
			"Отсутствуют отсканированные маркировки" + ДобТекст));    
			
		КонецЕсли;
		//-Шульман А. 28.11.2025 #UT10-5548 К05122025

		Возврат;
		
	КонецЕсли; 
	
	ТекстСообщения = "Маркировки записаны в ПТУ № %1 %2 . Документ проведен";
	
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, 
			РезультатСтруктура.Данные.НомерДокумента,
			РезультатСтруктура.Данные.ДатаДокумента 
			);						
			
	Закрыть();
	ОткрытьФорму("Обработка.ПриемкаКоллективная.Форма.ФормаСпискаПТУ");			
	Оповестить("МаркировкиЗаписаныВПТУ", Новый Структура("ТекстСообщения", ТекстСообщения));
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = "ГруппаНеСохраненныхМаркировок" Тогда
		
		РезультатСтруктура = ОбщегоНазначения.ПолучитьСписокМаркировокПоПТУ(Объект.ДокументГУИД);
		
		Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
			ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
			Закрыть();	
			Возврат;
		КонецЕсли; 
		
		//+Шульман А. 02.10.2025 #UT10-5438
		РезультатСтруктура = ОбщегоНазначения.ПолучитьСписокТоваровИзБуфераРазмещения(Объект.ДокументГУИД);     
		
		Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
			ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
			Закрыть();	
			Возврат;
		КонецЕсли; 
		//-Шульман А. 02.10.2025 #UT10-5438
		
		Элементы.СписокМаркировокВБуфере.Обновить();
		
	КонецЕсли; 	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНеотсканированныеМаркировки()
	
	//+Шульман А. 02.10.2025 #UT10-5438   
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписокТоваровДокументаПТУ.СсылкаТовара КАК СсылкаТовара,
		|	СписокТоваровДокументаПТУ.КоличествоТоваровСМаркировкой - СписокТоваровДокументаПТУ.КоличествоВБуфереМаркировок - СписокТоваровДокументаПТУ.КоличествоОтсканированныхМаркировок КАК Количество,
		|	СписокТоваровДокументаПТУ.КоличествоРазместитьДляВозврата КАК КоличествоРазместитьДляВозврата,
		|	СписокТоваровДокументаПТУ.НаименованиеТовара КАК НаименованиеТовара,
		|	СписокТоваровДокументаПТУ.ПревышенаДатаМаркировкиОстатков КАК ПревышенаДатаМаркировкиОстатков,
		|	СписокТоваровДокументаПТУ.ТоварнаяГруппа КАК ТоварнаяГруппа
		|ИЗ
		|	РегистрСведений.СписокТоваровДокументаПТУ КАК СписокТоваровДокументаПТУ
		|ГДЕ
		|	СписокТоваровДокументаПТУ.СсылкаПТУ = &СсылкаПТУ
		|	И СписокТоваровДокументаПТУ.ТоварТребуетсяМаркировка
		|	И СписокТоваровДокументаПТУ.КоличествоТоваровСМаркировкой > СписокТоваровДокументаПТУ.КоличествоВБуфереМаркировок + СписокТоваровДокументаПТУ.КоличествоОтсканированныхМаркировок";
	
	Запрос.УстановитьПараметр("СсылкаПТУ", Объект.ДокументГУИД);
	
	РезультатЗапроса = Запрос.Выполнить();   
	тзОстатокМаркировка.Очистить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		ДобСтрока = тзОстатокМаркировка.Добавить();
		ЗаполнитьЗначенияСвойств(ДобСтрока, Выборка);
		
	КонецЦикла;     
	
	Возврат Истина;
	//-Шульман А. 02.10.2025 #UT10-5438 
	
КонецФункции // ()

&НаСервереБезКонтекста
Функция ПолучитьЯчейкуДляМаркировки()
	
	Возврат Константы.ЯчейкаДляМаркировки.Получить();

КонецФункции // ()
